In [2]:
#Sorting and introduction to the inplace - parameter
# 6월 1일

In [4]:
import pandas as pd

In [6]:
dic = {1 : 10, 3 : 25, 2 : 15, 4:5, 5: 20, 6 : 0, 7 : None}

# 월요일에는 10개 화요일에는 15개 수요일에는 25개가 판매되었다는 딕셔너리 주간 판매량 토요일과 일요일은 판매가 없으므로

In [8]:
dic

{1: 10, 3: 25, 2: 15, 4: 5, 5: 20, 6: 0, 7: None}

In [10]:
sales = pd.Series(dic)

In [12]:
sales

1    10.0
3    25.0
2    15.0
4     5.0
5    20.0
6     0.0
7     NaN
dtype: float64

In [14]:
sales.sort_index()

1    10.0
2    15.0
3    25.0
4     5.0
5    20.0
6     0.0
7     NaN
dtype: float64

In [22]:
sales.sort_index(ascending= True ) # ascending 으로 True, False로 오름차순, 내림차순 설정 가능  
# 복사본을 만들어서 복사본만을 정렬한 것임 inplace: 'bool' = False 이기 때문에

1    10.0
2    15.0
3    25.0
4     5.0
5    20.0
6     0.0
7     NaN
dtype: float64

In [20]:
sales # 인덱스가 그대로임 , 정렬된 인덱스가 메모리에 저장되지 않는 다는 뜻

1    10.0
3    25.0
2    15.0
4     5.0
5    20.0
6     0.0
7     NaN
dtype: float64

In [26]:
 sales.sort_index(ascending=True, inplace=True) # inplace 를 True로 하면 원래값을 대신하게 됨

In [28]:
sales

1    10.0
2    15.0
3    25.0
4     5.0
5    20.0
6     0.0
7     NaN
dtype: float64

In [42]:
sales.sort_values(inplace=True, ascending=False, na_position="first") # 결측값 맨처음 or 맨끝 설정 가능 
sales

7     NaN
3    25.0
5    20.0
2    15.0
1    10.0
4     5.0
6     0.0
dtype: float64

In [44]:
dic = {"Mon" : 25, "Tue" : 10, "Wed" : 30, "Thu" : 40, "Fri" : 50, "Sat" : 0, "Sun" : 0}

In [46]:
dic

{'Mon': 25, 'Tue': 10, 'Wed': 30, 'Thu': 40, 'Fri': 50, 'Sat': 0, 'Sun': 0}

In [48]:
sales = pd.Series(dic)

In [50]:
sales

Mon    25
Tue    10
Wed    30
Thu    40
Fri    50
Sat     0
Sun     0
dtype: int64

In [54]:
sales.sort_index() # 인덱스가 문자열일 때는 아스키코드 기반

Fri    50
Mon    25
Sat     0
Sun     0
Thu    40
Tue    10
Wed    30
dtype: int64

In [56]:
# nlargest() and nsmallest

In [60]:
titanic = pd.read_csv("titanic.csv")

In [62]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [64]:
titanic.head

<bound method NDFrame.head of      survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]>

In [66]:
age = titanic.age

In [68]:
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [82]:
age.sort_values(ascending=False).head(3)

630    80.0
851    74.0
493    71.0
Name: age, dtype: float64

In [102]:
'''
"""
nlargest(
    n: 'int' = 5,
    keep: "Literal['first', 'last', 'all']" = 'first',
) -> 'Series'
Docstring:
Return the largest `n` elements.
"""
'''

age.nlargest(n = 3) # 가장 큰 원소들을 기본적으로 5개 출력하는 메서드 #

630    80.0
851    74.0
96     71.0
Name: age, dtype: float64

In [106]:
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [110]:
age.sort_values(ascending=True).iloc[:3] # 왼쪽에는 원본 데이터프레임의 rangeIndex 뜸

803    0.42
755    0.67
644    0.75
Name: age, dtype: float64

In [125]:
age.nsmallest().index # 인덱스 객체 얻을 수 있음

Index([803, 755, 469, 644, 78], dtype='int64')

In [115]:
# idxmin and idxmax

In [127]:
titanic = pd.read_csv("titanic.csv")

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [133]:
age = titanic.age

In [151]:
titanic.age.idxmin()

803

In [139]:
titanic.age.idxmax()

630

In [157]:
titanic.loc[803]

survived         1
pclass           3
sex           male
age           0.42
sibsp            0
parch            1
fare        8.5167
embarked         C
deck           NaN
Name: 803, dtype: object

In [159]:
titanic.loc[630]

survived       1
pclass         1
sex         male
age         80.0
sibsp          0
parch          0
fare        30.0
embarked       S
deck           A
Name: 630, dtype: object

In [161]:
titanic.loc[titanic.age.idxmax()] # 같은 결과를 얻을 수 있음

survived       1
pclass         1
sex         male
age         80.0
sibsp          0
parch          0
fare        30.0
embarked       S
deck           A
Name: 630, dtype: object

In [163]:
"""
idxmax() / idxmin()의 기본 동작
이름 그대로:

idxmax() → 값이 최대인 곳의 "인덱스(label)" 반환

idxmin() → 값이 최소인 곳의 "인덱스(label)" 반환

즉,
➔ "값을 기준으로 최대/최소를 찾되, 결과는 인덱스 라벨로 준다."
"""

'\nidxmax() / idxmin()의 기본 동작\n이름 그대로:\n\nidxmax() → 값이 최대인 곳의 "인덱스(label)" 반환\n\nidxmin() → 값이 최소인 곳의 "인덱스(label)" 반환\n\n즉,\n➔ "값을 기준으로 최대/최소를 찾되, 결과는 인덱스 라벨로 준다."\n'

In [166]:
# Manipulating Series

In [1]:
import pandas as pd

In [3]:
sales = pd.Series([10,25,6,36,2,0,None,5], index = ["Mon", "Tue", "Wed", "Thu", "Fri", "Sat", "Sun", "Mon"])
sales

Mon    10.0
Tue    25.0
Wed     6.0
Thu    36.0
Fri     2.0
Sat     0.0
Sun     NaN
Mon     5.0
dtype: float64

In [9]:
sales["Sun"] = 0

Mon    10.0
Tue    25.0
Wed     6.0
Thu    36.0
Fri     2.0
Sat     0.0
Sun     0.0
Mon     5.0
dtype: float64

In [13]:
# 순서를 이용한 인덱싱도 가능, 예를들어 네번째 원소를 선택하려면

In [17]:
sales.iloc[3] = 50 # 반드시 명시적으로 iloc 연산자 써주도록

In [19]:
sales

Mon    10.0
Tue    25.0
Wed     6.0
Thu    50.0
Fri     2.0
Sat     0.0
Sun     0.0
Mon     5.0
dtype: float64

In [21]:
# pandas Series 에서는 NumPy에서와 마찬가지로 원소들끼리 벡터화연산을 하는 것이 가능함
# 여러 원소에 대해서 for Loop 안돌리고 저수준 코드에서 배열(벡터) 단위로 한꺼번에 계산하는 것

"""
3. 대표 예시
python
복사
import pandas as pd
import numpy as np

s = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])
t = pd.Series([10, 20, 30, 40, 50], index=['a', 'b', 'c', 'd', 'e'])
목적	“벡터화” 한 줄 예	결과

스칼라(상수) 연산	s + 10	a 11 · b 12 · …
시리즈 간 연산	s * t	a 10 · b 40 · …
브로드캐스팅	s + np.array([100, 200, 300, 400, 500])	a 101 · b 202 · …
수학 함수	np.log(s)	ln 1, ln 2, …
불리언 필터	s[s > 3]	d 4 · e 5
복합 표현	(s**2 + t).clip(upper=70)	a 11 · b 24 · c 39 · d 70 · e 70
"""

"\n3. 대표 예시\npython\n복사\nimport pandas as pd\nimport numpy as np\n\ns = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])\nt = pd.Series([10, 20, 30, 40, 50], index=['a', 'b', 'c', 'd', 'e'])\n목적\t“벡터화” 한 줄 예\t결과\n\n스칼라(상수) 연산\ts + 10\ta 11 · b 12 · …\n시리즈 간 연산\ts * t\ta 10 · b 40 · …\n브로드캐스팅\ts + np.array([100, 200, 300, 400, 500])\ta 101 · b 202 · …\n수학 함수\tnp.log(s)\tln 1, ln 2, …\n불리언 필터\ts[s > 3]\td 4 · e 5\n복합 표현\t(s**2 + t).clip(upper=70)\ta 11 · b 24 · c 39 · d 70 · e 70\n"

In [23]:
# 만약 위의 데이터의 원소들이 달러일 때의 값이고 유로화를 해준다고 한다면?
# 즉 1유로가 1.1 달러인 상황
# 여기서 리스트로 바꾸어서 계산을 하려면 for문을 이용해 각 원소마다 계싼해줘야함

In [27]:
(sales/1.1).round(2) # 소수 둘 째자리 까지 표현, Series 에서 벡터화 연산이 가능하기 때문에 다음과 같이 연산이 가능함

Mon     9.09
Tue    22.73
Wed     5.45
Thu    45.45
Fri     1.82
Sat     0.00
Sun     0.00
Mon     4.55
dtype: float64

In [29]:
sales_UR = (sales/1.1).round(2)

In [31]:
sales_UR

Mon     9.09
Tue    22.73
Wed     5.45
Thu    45.45
Fri     1.82
Sat     0.00
Sun     0.00
Mon     4.55
dtype: float64

In [33]:
sales = (sales/1.1).round(2)

In [35]:
sales

Mon     9.09
Tue    22.73
Wed     5.45
Thu    45.45
Fri     1.82
Sat     0.00
Sun     0.00
Mon     4.55
dtype: float64

In [37]:
# 만약 지난주의 월요일의 값이 잘못 기입되었다고 가정했을 때 만약 판매량 0이 맞는 값이라고 가정하면?

In [39]:
sales["Mon"] = 0

In [41]:
sales

Mon     0.00
Tue    22.73
Wed     5.45
Thu    45.45
Fri     1.82
Sat     0.00
Sun     0.00
Mon     0.00
dtype: float64

In [43]:
# 라벨기반으로하면 지난 주 이번 주 월요일의 값이 전부 0이 됨

In [46]:
titanic = pd.read_csv("titanic.csv")

In [50]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [52]:
age = titanic.age

In [54]:
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [56]:
age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [58]:
age.iloc[1] = 30

/var/folders/1b/d24k1cl162s2drg4n6yln3500000gn/T/ipykernel_82058/1477452854.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  age.iloc[1] = 30

In [60]:
titanic # 데이터 프레임의 값 까지 바뀐 것을 확인할 수 있음 이것에 대해선 나중에 더 깊게 공부

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  30.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]